Flow Around Cylinder/Re 1600/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    { 
        type            fixedValue;
        value           uniform (0.05645785 0 0);
    }
    outlet
    {
        type        zeroGradient;
    }
    wall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    obstacle
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
